<h1>Операции в php</h1>
<h2>Арифметические операции</h2>
<p> + - * / ** %</p>
<?php
$a =  33 % 22;
echo $a;
?>
<h2>Инкремент и декремент</h2>
<?php 
$b = 2;
$c = ++$b;
echo "b = $b,  c = $c";
?>
<h2>Операции со строками</h2>
<?php 
$str1 = 'Hello';
$str2 = 'PHP!';
$str3 = 'я учусь на '. 2 . ' курсе';
echo $str1 . $str2, '<br>', $str3;
?>
<h2>Операции сравнения</h2>
<p>< > <= >= != === !==</p>
<?php 
$s = 4 == '4';
$s1 = 4 === '4';
echo $s;
?>
<p>Логическоое и (&& and), логическое или ( // or) и логическое (!))</p>
<?php 
$p = true && false; // false;
$p1 = true || false; // false;
$p2 = 5 <= 7 && 4 == 5;// false;
$p3 = !$p2; // true;     
?>
<h2>Операции присваниваиния</h2>
<p>= </p>
<?php $o = $r = 5; // o и r = 5?>
<p>+= -= *= %= .=</p>
<?php
$l = 42;
$l += 10;
$string = 'hello';
$string .= 'world!';
echo $string;
?>
<h2>приоритет присваивания</h2>
<p>**</p>
<p>++ --</p>
<p>!</p>
<p>* / %</p>
<p>+ -</p>
<p>< > <= >=<</p>
<p>== != === !==</p>
<p>&&</p>
<p>||</p>
<p>= += -= ...</p>
<p>Ошибка распрастраненное
$a < $b < $c </p>